Tekla Open API Reference for Tekla Structures 2025
ModelHandler.Save Method (String, String)
 Saves current model with comment and user information.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Save(
	string Comment = "",
	string User = ""
)
Public Function Save (
	Optional Comment As String = "",
	Optional User As String = ""
) As Boolean
Parameters
Comment (Optional)
Type: System.String
The comment for save operation, used only with multi-user models.
User (Optional)
Type: System.String
The user identification, used only with multi-user models.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelHandler Class
Save Overload
Tekla.Structures.Model Namespace